IRP/src/Catalogs/AccessProfiles/AccessProfiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AccessProfiles</name>
  <tabularSections>
    <name>Roles</name>
    <attributes>
      <name>Role</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Configuration</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ObjectAccess</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ValueRef</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Modify</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>DoNotControl</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/InformationRegisters/T9101A_ObjectAccessRegisters/T9101A_ObjectAccessRegisters.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>T9101A_ObjectAccessRegisters</name>
  <resources>
    <name>Value1</name>
    <type>
      <types>AnyRef</types>
    </type>
  </resources>
  <resources>
    <name>Value2</name>
    <type>
      <types>AnyRef</types>
    </type>
  </resources>
  <resources>
    <name>Value3</name>
    <type>
      <types>AnyRef</types>
    </type>
  </resources>
  <resources>
    <name>Value4</name>
    <type>
      <types>AnyRef</types>
    </type>
  </resources>
  <resources>
    <name>Value5</name>
    <type>
      <types>AnyRef</types>
    </type>
  </resources>
  <dimensions>
    <name>AccessProfile</name>
    <type>
      <types>CatalogRef.AccessProfiles</types>
    </type>
  </dimensions>
  <dimensions>
    <name>TableName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>UUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/Catalogs/AccessProfiles/ObjectModule.bsl
Procedure BeforeWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Cancel Then
		Return;
	EndIf;
	
	RegRule = InformationRegisters.T9101A_ObjectAccessRegisters.CreateRecordSet();
	RegRule.Filter.AccessProfile.Set(ThisObject.Ref);
	RegRule.Write();

	If Not ThisObject.DeletionMark Then
		For Each RegInfo In Metadata.AccumulationRegisters Do
			Module = MetadataInfo.GetManager(RegInfo.FullName()); // AccumulationRegistersManager
			Try
				AccessKeys = Module.GetAccessKey();
			Except
				// Object not connected to access subsystem
				Continue;		
			EndTry;
			
			If AccessKeys.Count() = 0 Then
				// Object not using access keys
				Continue;
			EndIf;
			
			KeyValueArray = New Array;
			For Each AccessKey In AccessKeys Do
				KeyValueArray.Add(ThisObject.ObjectAccess.Unload(New Structure("Key", AccessKey.Key)).UnloadColumn("ValueRef"));
			EndDo;
			
			Query = New Query("SELECT * FROM InformationRegister.T9101A_ObjectAccessRegisters WHERE FALSE");
			ResultTable = Query.Execute().Unload();
			For i = 0 To KeyValueArray.UBound() Do
				TmpTable = ResultTable.Copy();
				ResultTable.Clear();
				ValueArray = KeyValueArray[i];
				For Each Value In ValueArray Do
					If TmpTable.Count() > 0 Then
						For Each ResRow In TmpTable Do
							NewRow = ResultTable.Add();
							FillPropertyValues(NewRow, ResRow);
							NewRow["Value" + (i + 1)] = Value;
						EndDo;
					Else
						NewRow = ResultTable.Add();
						NewRow["Value" + (i + 1)] = Value;
					EndIf;
				EndDo;
			EndDo;
			
			For Each Row In ResultTable Do
				
				Reg = InformationRegisters.T9101A_ObjectAccessRegisters.CreateRecordManager();
				FillPropertyValues(Reg, Row);
				Reg.AccessProfile = ThisObject.Ref;
				Reg.TableName = RegInfo.FullName();
				Reg.UUID = String(New UUID);
				Reg.Write();
			EndDo;
			
		EndDo;
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure
